Revit 2027 API
PointIterator.MoveNext Method
 Increments the iterator to the next point in the collection.
Namespace: Autodesk.Revit.DB.PointClouds
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual bool MoveNext()
Public Overridable Function MoveNext As Boolean
public:
virtual bool MoveNext()
abstract MoveNext : unit -> bool
override MoveNext : unit -> bool
Return Value
Boolean
 True if there is another available point in this iterator. False if the iterator has completed all available points.
See Also
Reference
PointIterator Class
Autodesk.Revit.DB.PointClouds Namespace